
Функция Вывестиgetindex(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);// содержит ответ, формируемый HTTP-сервисом.
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");// указываем в каком формате вывести результат, в нашем случае html
	index = ОбщегоНазначенияСервер.УстановитьПараметрыШаблона("<par_body/>", "Hello world!!!!!!!!");// передаем параметр "Hello world"
	Ответ.УстановитьТелоИзСтроки(index);  // устанавливает тело ответа из строки	 
	Возврат Ответ;

КонецФункции
