
Функция ПолучитьОсновнойСклад()
	Возврат Справочники.Склады.ОсновнойСклад;
КонецФункции

Функция GetLocalCodeAction(Запрос)
	//ПараметрыЗапроса = Запрос.ПолучитьТелоКакСтроку();
	//Если ПараметрыЗапроса Тогда
	//	Ответ = "Информация с параметрами";
	//Иначе
	//	Ответ = "Информация без параметров";
	//КонецЕсли;
	Ответ = ПолучитьОсновнойСклад();
	сообщить(Ответ);
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	Возврат HTTPОтвет;
КонецФункции
